console.log(22);

console.log("Task 1 ___________________________________________________________________")
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

let arr = ['a', 'b', 'c'];

for (let i = 1; i <= 3; i++) {
    arr.push(i);
}
console.log(arr);

console.log("Task 2 ___________________________________________________________________")
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

let arr2 = [1, 2, 3];
let reverse = [];

// Variant 1
// reverse = arr2.reverse();

// Variant 2
for (let i = arr2.length - 1; i >= 0; i--) {
    reverse.push(arr2[i])
}

console.log(reverse);

console.log("Task 3 ___________________________________________________________________")
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
let arr3 = [1, 2, 3];
arr3.push(4, 5, 6);

console.log(arr3);

console.log("Task 4 ___________________________________________________________________")
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
arr3.unshift(4, 5, 6);

console.log(arr3);

console.log("Task 5 ___________________________________________________________________")
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
let progLeng = ['js', 'css', 'jq'];

let delStart = progLeng.shift();
document.write(delStart);

console.log("Task 6 ___________________________________________________________________")
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
let delEnd = progLeng.pop();

document.write("<br/>");
document.write(delEnd);

console.log("Task 7 ___________________________________________________________________")
// - Дан масив . За допомогою методу/функції slice перетворіть масив в [4, 5].

let arr4 = [1, 2, 3, 4, 5];

console.log(arr4.slice(3));

console.log("Task 8 ___________________________________________________________________")
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].

console.log(arr4.slice(0, -3));

console.log("Task 9 ___________________________________________________________________")
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].

let arr5 = [1, 2, 3, 4, 5];
arr5.splice(0, 3, 1)
console.log(arr5);

console.log("Task 10 ___________________________________________________________________")
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
let arr6 = [1, 2, 3, 4, 5];
arr6.splice(3, 1, ...['a','b','c']);

console.log(arr6);

console.log("Task 11 ___________________________________________________________________")
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

let arr7 = [1, 2, 3, 4, 5];
arr7.splice(1, 0, ...['a','b']);
arr7.splice(6, 0, 'c');
arr7.splice(8, 0, 'e');

console.log(arr7);

console.log("Task 12 ___________________________________________________________________")
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
let  arr8 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

for (let i=0; i<=arr8.length; i++){
    if (arr8[i] % 2 === 0) {
        console.log(arr8[i])
    }
}

console.log("Task 13 ___________________________________________________________________")
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший

let arr9 = [];
for (let i=0; i<=arr8.length-1; i++){
    arr9.push(arr8[i]);
    }

    console.log(arr9);

console.log("Task 14 ___________________________________________________________________")
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.

let arr10 = [];
for (let i=0; i<=arr8.length-1; i++){
    arr10[i]=arr8[i];
}

console.log(arr10);

